In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import re
from datetime import date

In [2]:
data = pd.read_csv('%s.csv'%str(date.today()))

In [3]:
data = data.drop(['Unnamed: 0', '#','1 Caseevery X ppl','1 Deathevery X ppl','1 Testevery X ppl','New Cases/1M pop','New Deaths/1M pop','Active Cases/1M pop'],axis=1)
Toltal = data.iloc[0]
data = data.drop(0, axis =0)
data = data.rename(columns={'Tests/\n1M pop\n':'Tests/1M pop'},inplace= False)
data = data.set_index(np.arange(len(data)), drop = True)

In [4]:
data

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop,Deaths/1M pop,TotalTests,Tests/1M pop,Population,Continent
0,USA,"33,554,277","+4,162","597,052",+106,"26,558,619",+481,"6,398,606","8,775","100,864","1,795","460,458,760","1,384,132","332,669,677",North America
1,India,"23,588,999","+248,573","256,940","+2,715","19,611,259","+234,609","3,720,800","8,944","16,950",185,"307,583,991","221,022","1,391,642,201",Asia
2,Brazil,"15,285,048",NaN,"425,711",NaN,"13,847,191",NaN,"1,012,146","8,318","71,473","1,991","46,834,128","218,998","213,856,608",South America
3,France,"5,800,170",NaN,"106,935",NaN,"4,951,745",NaN,"741,490","4,743","88,691","1,635","79,617,249","1,217,432","65,397,697",Europe
4,Turkey,"5,059,433",NaN,"43,589",NaN,"4,766,124",NaN,"249,720","2,975","59,441",512,"49,830,456","585,433","85,117,272",Asia
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
217,Saint Pierre Miquelon,25,NaN,,NaN,25,NaN,0,NaN,"4,333",NaN,"5,318","921,664","5,770",North America
218,Solomon Islands,20,NaN,,NaN,20,NaN,0,NaN,29,NaN,"4,500","6,417","701,257",Australia/Oceania
219,Marshall Islands,4,NaN,,NaN,4,NaN,0,NaN,67,NaN,NaN,NaN,"59,533",Australia/Oceania
220,Saint Helena,2,NaN,,NaN,2,NaN,0,NaN,328,NaN,NaN,NaN,"6,093",Africa
221,Micronesia,1,NaN,,NaN,1,NaN,0,NaN,9,NaN,NaN,NaN,"116,057",Australia/Oceania

- Kiểm tra duplicate

In [5]:
data.duplicated().sum()

0

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 222 entries, 0 to 221
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country,Other     222 non-null    object
 1   TotalCases        222 non-null    object
 2   NewCases          88 non-null     object
 3   TotalDeaths       222 non-null    object
 4   NewDeaths         67 non-null     object
 5   TotalRecovered    222 non-null    object
 6   NewRecovered      85 non-null     object
 7   ActiveCases       222 non-null    object
 8   Serious,Critical  147 non-null    object
 9   Tot Cases/1M pop  220 non-null    object
 10  Deaths/1M pop     206 non-null    object
 11  TotalTests        210 non-null    object
 12  Tests/1M pop      210 non-null    object
 13  Population        222 non-null    object
 14  Continent         220 non-null    object
dtypes: object(15)
memory usage: 27.8+ KB

- Các cột được chia ra thành hai hai kiểu dữ liệu đó là:
    + cate_cols: bao gồm hai cột là : 'Country,Other','Continent'
    + numberic_cols: bao gồm các cột còn lại.

In [7]:
cate_cols = ['Country,Other','Continent']
numberic_cols = data.columns.difference(cate_cols)

In [8]:
numberic_cols

Index(['ActiveCases', 'Deaths/1M pop', 'NewCases', 'NewDeaths', 'NewRecovered',
       'Population', 'Serious,Critical', 'Tests/1M pop', 'TotalCases',
       'TotalDeaths', 'TotalRecovered', 'TotalTests', 'Tot Cases/1M pop'],
      dtype='object')

In [9]:
data[numberic_cols]

,ActiveCases,Deaths/1M pop,NewCases,NewDeaths,NewRecovered,Population,"Serious,Critical",Tests/1M pop,TotalCases,TotalDeaths,TotalRecovered,TotalTests,Tot Cases/1M pop
0,"6,398,606","1,795","+4,162",+106,+481,"332,669,677","8,775","1,384,132","33,554,277","597,052","26,558,619","460,458,760","100,864"
1,"3,720,800",185,"+248,573","+2,715","+234,609","1,391,642,201","8,944","221,022","23,588,999","256,940","19,611,259","307,583,991","16,950"
2,"1,012,146","1,991",NaN,NaN,NaN,"213,856,608","8,318","218,998","15,285,048","425,711","13,847,191","46,834,128","71,473"
3,"741,490","1,635",NaN,NaN,NaN,"65,397,697","4,743","1,217,432","5,800,170","106,935","4,951,745","79,617,249","88,691"
4,"249,720",512,NaN,NaN,NaN,"85,117,272","2,975","585,433","5,059,433","43,589","4,766,124","49,830,456","59,441"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
217,0,NaN,NaN,NaN,NaN,"5,770",NaN,"921,664",25,,25,"5,318","4,333"
218,0,NaN,NaN,NaN,NaN,"701,257",NaN,"6,417",20,,20,"4,500",29
219,0,NaN,NaN,NaN,NaN,"59,533",NaN,NaN,4,,4,NaN,67
220,0,NaN,NaN,NaN,NaN,"6,093",NaN,NaN,2,,2,NaN,328
221,0,NaN,NaN,NaN,NaN,"116,057",NaN,NaN,1,,1,NaN,9

- Xử lí các cột dữ liệu numberic:
    + Xóa dấu '+' đứng trước mỗi giá trị.
    + Điền các giá trị thiếu bằng '0'
    + Chuyển đổi kiểu dữ liệu từ object sang kiểu int64

In [10]:
data[numberic_cols] = data[numberic_cols].apply\
(lambda x: x.str.replace(re.compile(r'[+.,]'), ''))#.replace(' ',np.nan)).fillna('0').astype('int64')

In [11]:
data

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop,Deaths/1M pop,TotalTests,Tests/1M pop,Population,Continent
0,USA,33554277,4162,597052,106,26558619,481,6398606,8775,100864,1795,460458760,1384132,332669677,North America
1,India,23588999,248573,256940,2715,19611259,234609,3720800,8944,16950,185,307583991,221022,1391642201,Asia
2,Brazil,15285048,NaN,425711,NaN,13847191,NaN,1012146,8318,71473,1991,46834128,218998,213856608,South America
3,France,5800170,NaN,106935,NaN,4951745,NaN,741490,4743,88691,1635,79617249,1217432,65397697,Europe
4,Turkey,5059433,NaN,43589,NaN,4766124,NaN,249720,2975,59441,512,49830456,585433,85117272,Asia
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
217,Saint Pierre Miquelon,25,NaN,,NaN,25,NaN,0,NaN,4333,NaN,5318,921664,5770,North America
218,Solomon Islands,20,NaN,,NaN,20,NaN,0,NaN,29,NaN,4500,6417,701257,Australia/Oceania
219,Marshall Islands,4,NaN,,NaN,4,NaN,0,NaN,67,NaN,NaN,NaN,59533,Australia/Oceania
220,Saint Helena,2,NaN,,NaN,2,NaN,0,NaN,328,NaN,NaN,NaN,6093,Africa
221,Micronesia,1,NaN,,NaN,1,NaN,0,NaN,9,NaN,NaN,NaN,116057,Australia/Oceania

In [12]:
data[cate_cols].isna().sum()

Country,Other    0
Continent        2
dtype: int64

In [13]:
data[data.Continent.isna()]

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop,Deaths/1M pop,TotalTests,Tests/1M pop,Population,Continent
208,Diamond Princess,712,NaN,13,NaN,699,NaN,0,NaN,NaN,NaN,NaN,NaN,,NaN
211,MS Zaandam,9,NaN,2,NaN,7,NaN,0,NaN,NaN,NaN,NaN,NaN,,NaN

- Sau khi tìm hiểu Diamond Princess và MS Zaandam là hai du thuyền bị nhiễm corona nên sẽ điền vào ở thuộc tính Continent là Ship

In [14]:
data[cate_cols] = data[cate_cols].fillna('Ship')

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 222 entries, 0 to 221
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country,Other     222 non-null    object
 1   TotalCases        222 non-null    object
 2   NewCases          88 non-null     object
 3   TotalDeaths       222 non-null    object
 4   NewDeaths         67 non-null     object
 5   TotalRecovered    222 non-null    object
 6   NewRecovered      85 non-null     object
 7   ActiveCases       222 non-null    object
 8   Serious,Critical  147 non-null    object
 9   Tot Cases/1M pop  220 non-null    object
 10  Deaths/1M pop     206 non-null    object
 11  TotalTests        210 non-null    object
 12  Tests/1M pop      210 non-null    object
 13  Population        222 non-null    object
 14  Continent         222 non-null    object
dtypes: object(15)
memory usage: 27.8+ KB

In [16]:
data

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop,Deaths/1M pop,TotalTests,Tests/1M pop,Population,Continent
0,USA,33554277,4162,597052,106,26558619,481,6398606,8775,100864,1795,460458760,1384132,332669677,North America
1,India,23588999,248573,256940,2715,19611259,234609,3720800,8944,16950,185,307583991,221022,1391642201,Asia
2,Brazil,15285048,NaN,425711,NaN,13847191,NaN,1012146,8318,71473,1991,46834128,218998,213856608,South America
3,France,5800170,NaN,106935,NaN,4951745,NaN,741490,4743,88691,1635,79617249,1217432,65397697,Europe
4,Turkey,5059433,NaN,43589,NaN,4766124,NaN,249720,2975,59441,512,49830456,585433,85117272,Asia
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
217,Saint Pierre Miquelon,25,NaN,,NaN,25,NaN,0,NaN,4333,NaN,5318,921664,5770,North America
218,Solomon Islands,20,NaN,,NaN,20,NaN,0,NaN,29,NaN,4500,6417,701257,Australia/Oceania
219,Marshall Islands,4,NaN,,NaN,4,NaN,0,NaN,67,NaN,NaN,NaN,59533,Australia/Oceania
220,Saint Helena,2,NaN,,NaN,2,NaN,0,NaN,328,NaN,NaN,NaN,6093,Africa
221,Micronesia,1,NaN,,NaN,1,NaN,0,NaN,9,NaN,NaN,NaN,116057,Australia/Oceania

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 222 entries, 0 to 221
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Country,Other     222 non-null    object
 1   TotalCases        222 non-null    object
 2   NewCases          88 non-null     object
 3   TotalDeaths       222 non-null    object
 4   NewDeaths         67 non-null     object
 5   TotalRecovered    222 non-null    object
 6   NewRecovered      85 non-null     object
 7   ActiveCases       222 non-null    object
 8   Serious,Critical  147 non-null    object
 9   Tot Cases/1M pop  220 non-null    object
 10  Deaths/1M pop     206 non-null    object
 11  TotalTests        210 non-null    object
 12  Tests/1M pop      210 non-null    object
 13  Population        222 non-null    object
 14  Continent         222 non-null    object
dtypes: object(15)
memory usage: 27.8+ KB

In [18]:
data.to_csv('%s_copy.csv'%str(date.today()))

In [19]:
pd.read_csv('%s_copy.csv'%str(date.today()), index_col=0)

,"Country,Other",TotalCases,NewCases,TotalDeaths,NewDeaths,TotalRecovered,NewRecovered,ActiveCases,"Serious,Critical",Tot Cases/1M pop,Deaths/1M pop,TotalTests,Tests/1M pop,Population,Continent
0,USA,33554277,4162.0,597052,106.0,26558619,481.0,6398606,8775.0,100864.0,1795.0,460458760.0,1384132.0,332669677,North America
1,India,23588999,248573.0,256940,2715.0,19611259,234609.0,3720800,8944.0,16950.0,185.0,307583991.0,221022.0,1391642201,Asia
2,Brazil,15285048,NaN,425711,NaN,13847191,NaN,1012146,8318.0,71473.0,1991.0,46834128.0,218998.0,213856608,South America
3,France,5800170,NaN,106935,NaN,4951745,NaN,741490,4743.0,88691.0,1635.0,79617249.0,1217432.0,65397697,Europe
4,Turkey,5059433,NaN,43589,NaN,4766124,NaN,249720,2975.0,59441.0,512.0,49830456.0,585433.0,85117272,Asia
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
217,Saint Pierre Miquelon,25,NaN,,NaN,25,NaN,0,NaN,4333.0,NaN,5318.0,921664.0,5770,North America
218,Solomon Islands,20,NaN,,NaN,20,NaN,0,NaN,29.0,NaN,4500.0,6417.0,701257,Australia/Oceania
219,Marshall Islands,4,NaN,,NaN,4,NaN,0,NaN,67.0,NaN,NaN,NaN,59533,Australia/Oceania
220,Saint Helena,2,NaN,,NaN,2,NaN,0,NaN,328.0,NaN,NaN,NaN,6093,Africa
221,Micronesia,1,NaN,,NaN,1,NaN,0,NaN,9.0,NaN,NaN,NaN,116057,Australia/Oceania